dakejahl/PX4-Autopilot/platforms/nuttx/src/px4/stm/stm32_common/dshot/dshot.c
			if (this_timer && channel_enabled) {
				uint32_t dma_map_ch = io_timers[timer_index].dshot.dma_map_ch[timer_channel_index];

				if (dma_map_ch == 0) {
					// Timer channel is not mapped
					PX4_WARN("Error! Timer %u Channel %u DMA is unmapped", timer_index, timer_channel_index);
					continue;
				}

				// Allocate DMA
				timer_configs[timer_index].dma_ch_handle[timer_channel_index] = stm32_dmachannel(dma_map_ch);

				if (timer_configs[timer_index].dma_ch_handle[timer_channel_index] == NULL) {
					PX4_WARN("Failed to allocate Timer %u Channel DMA CH %u, output_channel %u", timer_index, timer_channel_index,
						 output_channel);
					break;
				}

				PX4_INFO("Allocated DMA CH Timer Index %u Channel %u", timer_index, timer_channel_index);
				// Mark this timer channel as bidirectional
				timer_configs[timer_index].bidirectional_channels[timer_channel_index] = true;
			}
		}

		// De-allocate DMA for each channel
		for (uint8_t output_channel = 0; output_channel < MAX_TIMER_IO_CHANNELS; output_channel++) {
			if (timer_index == timer_io_channels[output_channel].timer_index) {
				uint8_t timer_channel_index = timer_io_channels[output_channel].timer_channel - 1;

				if (timer_configs[timer_index].dma_ch_handle[timer_channel_index]) {
					stm32_dmafree(timer_configs[timer_index].dma_ch_handle[timer_channel_index]);
					timer_configs[timer_index].dma_ch_handle[timer_channel_index] = NULL;
				}
			}
		}
	}
}

int up_dshot_init(uint32_t channel_mask, unsigned dshot_pwm_freq, bool enable_bidirectional_dshot)
{
	_dshot_frequency = dshot_pwm_freq;
	_bidirectional = enable_bidirectional_dshot;

	// First things first mark the timers we want to use
	for (unsigned output_channel = 0; output_channel < MAX_TIMER_IO_CHANNELS; output_channel++) {
		if (channel_mask & (1 << output_channel)) {
			uint8_t timer_index = timer_io_channels[output_channel].timer_index;
			uint8_t timer_channel_index = timer_io_channels[output_channel].timer_channel - 1;

			if (io_timers[timer_index].dshot.dma_base == 0) {
				// board does not configure dshot on this timer
				continue;
			}

			// NOTE: this is necessary to pass timer_index to DMA callback
			timer_configs[timer_index].timer_index = timer_index;
			// Mark timer as enabled
			timer_configs[timer_index].enabled = true;
			// Mark channel as enabled
			timer_configs[timer_index].enabled_channels[timer_channel_index] = true;

			// Mark timer as bidirectional
			if (enable_bidirectional_dshot && timer_index == _bidi_timer_index) {
				timer_configs[timer_index].bidirectional = true;
			}
		}
	}

	// Initializes dshot on each timer if DShot mode is enabled and DMA is available
	init_dshot_timers();

	// Initializes a single timer in Bidirectional DShot mode
	if (enable_bidirectional_dshot) {
		// Use first configured DShot timer (Timer index 0)
		// TODO: BDSHOT_TIM param to select timer index?
		init_dshot_bidirectional(_bidi_timer_index);
	}

	// Initialize each timer/channel
	int32_t channels_init_mask = 0;

	for (uint8_t timer_index = 0; timer_index < MAX_IO_TIMERS; timer_index++) {

		if (!timer_configs[timer_index].enabled || !timer_configs[timer_index].initialized) {
			// timer is not enabled or could not be initialized
			continue;
		}

		io_timer_channel_mode_t mode = timer_configs[timer_index].bidirectional ? IOTimerChanMode_DshotInverted :
					       IOTimerChanMode_Dshot;

		for (uint8_t output_channel = 0; output_channel < MAX_TIMER_IO_CHANNELS; output_channel++) {
			uint8_t timer_channel_index = timer_io_channels[output_channel].timer_channel - 1;
			bool this_timer = timer_index == timer_io_channels[output_channel].timer_index;
			bool channel_enabled = timer_configs[timer_index].enabled_channels[timer_channel_index];

			if (this_timer && channel_enabled) {
				int ret = io_timer_channel_init(output_channel, mode, NULL, NULL);

				if (ret != OK) {
					PX4_INFO("io_timer_channel_init %u failed", output_channel);
					continue;
				}

				timer_configs[timer_index].initialized_channels[timer_channel_index] = true;
				channels_init_mask |= (1 << output_channel);

				if (timer_configs[timer_index].bidirectional) {
					PX4_INFO("Bidi-DShot initialized OutputChannel %u", output_channel);

				} else {
					PX4_INFO("DShot initialized OutputChannel %u", output_channel);
				}
			}
		}
	}

	unsigned output_buffer_offset = 0;

	for (unsigned timer_index = 0; timer_index < MAX_IO_TIMERS; timer_index++) {
		if (timer_configs[timer_index].initialized) {
			if (io_timers[timer_index].base == 0) { // no more timers configured
				break;
			}

			// we know the uint8_t* cast to uint32_t* is fine, since we're aligned to cache line size
#pragma GCC diagnostic push
#pragma GCC diagnostic ignored "-Wcast-align"
			dshot_output_buffer[timer_index] = (uint32_t *) &dshot_burst_buffer_array[output_buffer_offset];

#pragma GCC diagnostic pop
			uint32_t channel_count = io_timers_channel_mapping.element[timer_index].channel_count_including_gaps;
			output_buffer_offset += DSHOT_OUTPUT_BUFFER_SIZE(channel_count);

			if (output_buffer_offset > sizeof(dshot_burst_buffer_array)) {
				return -EINVAL; // something is wrong with the board configuration or some other logic
			}
		}
	}

	return channels_init_mask;
}

// Kicks off a DMA transmit for each configured timer and the associated channels
void up_dshot_trigger()
{
	// Enable DShot inverted on all channels
	// TODO: we may have DShot and Bidi-DShot simultaneously?
	io_timer_set_enable(true, _bidirectional ? IOTimerChanMode_DshotInverted : IOTimerChanMode_Dshot,
			    IO_TIMER_ALL_MODES_CHANNELS);

	// For each timer, begin DMA transmit
	for (uint8_t timer_index = 0; timer_index < MAX_IO_TIMERS; timer_index++) {
		if (timer_configs[timer_index].enabled && timer_configs[timer_index].initialized) {

			uint32_t channel_count = io_timers_channel_mapping.element[timer_index].channel_count_including_gaps;

			io_timer_set_dshot_burst_mode(timer_index, _dshot_frequency, channel_count);

			// Allocate DMA
			if (timer_configs[timer_index].dma_up_handle == NULL) {
				timer_configs[timer_index].dma_up_handle = stm32_dmachannel(io_timers[timer_index].dshot.dma_map_up);

				if (timer_configs[timer_index].dma_up_handle == NULL) {
					PX4_INFO("DMA allocation for timer %u failed", timer_index);
					continue;
				}
			}

