dakejahl/PX4-Autopilot/platforms/nuttx/src/px4/stm/stm32_common/dshot/dshot.c
			// Flush cache so DMA sees the data
			up_clean_dcache((uintptr_t) dshot_output_buffer[timer_index],
					(uintptr_t) dshot_output_buffer[timer_index] +
					DSHOT_OUTPUT_BUFFER_SIZE(channel_count));

			px4_stm32_dmasetup(timer_configs[timer_index].dma_up_handle,
					   io_timers[timer_index].base + STM32_GTIM_DMAR_OFFSET,
					   (uint32_t)(dshot_output_buffer[timer_index]),
					   channel_count * CHANNEL_OUTPUT_BUFF_SIZE,
					   DSHOT_DMA_SCR);

			// Clean UDE flag before DMA is started
			io_timer_update_dma_req(timer_index, false);

			// Trigger DMA (DShot Outputs)
			if (timer_configs[timer_index].bidirectional) {
				stm32_dmastart(timer_configs[timer_index].dma_up_handle, dma_burst_finished_callback,
					       &timer_configs[timer_index].timer_index,
					       false);

			} else {
				stm32_dmastart(timer_configs[timer_index].dma_up_handle,  NULL, NULL, false);
			}

			// Enable DMA update request
			io_timer_update_dma_req(timer_index, true);

			// DEBUGGING
			// px4_arch_gpiowrite(GPIO_FMU_CH8, true);
		}
	}
}

void dma_burst_finished_callback(DMA_HANDLE handle, uint8_t status, void *arg)
{
	// DEBUGGING
	// px4_arch_gpiowrite(GPIO_FMU_CH8, false);

	uint8_t timer_index = *((uint8_t *)arg);

	// Clean DMA UP configuration
	if (timer_configs[timer_index].dma_up_handle != NULL) {
		stm32_dmastop(timer_configs[timer_index].dma_up_handle);
		stm32_dmafree(timer_configs[timer_index].dma_up_handle);
		timer_configs[timer_index].dma_up_handle = NULL;
	}

	// Disable DMA update request
	io_timer_update_dma_req(timer_index, false);

	// De-allocate timer
	io_timer_unallocate_timer(timer_index);

	// Disable / Init timer channels first
	for (uint8_t output_channel = 0; output_channel < MAX_TIMER_IO_CHANNELS; output_channel++) {

		bool is_this_timer = timer_index == timer_io_channels[output_channel].timer_index;
		uint8_t timer_channel_index = timer_io_channels[output_channel].timer_channel - 1;
		bool channel_enabled = timer_configs[timer_index].enabled_channels[timer_channel_index];
		bool bidirectional_enabled = timer_configs[timer_index].bidirectional_channels[timer_channel_index];

		if (is_this_timer && channel_enabled && bidirectional_enabled) {
			io_timer_unallocate_channel(output_channel);
			io_timer_channel_init(output_channel, IOTimerChanMode_CaptureDMA, NULL, NULL);
		}
	}

	// Allocate DMA for all enabled channels on this timer
	for (uint8_t output_channel = 0; output_channel < MAX_TIMER_IO_CHANNELS; output_channel++) {

		bool is_this_timer = timer_index == timer_io_channels[output_channel].timer_index;
		uint8_t timer_channel_index = timer_io_channels[output_channel].timer_channel - 1;
		bool channel_enabled = timer_configs[timer_index].enabled_channels[timer_channel_index];
		bool bidirectional_enabled = timer_configs[timer_index].bidirectional_channels[timer_channel_index];

		if (is_this_timer && channel_enabled && bidirectional_enabled) {

			// Allocate DMA
			if (timer_configs[timer_index].dma_ch_handle[timer_channel_index] == NULL) {
				timer_configs[timer_index].dma_ch_handle[timer_channel_index] = stm32_dmachannel(
							io_timers[timer_index].dshot.dma_map_ch[timer_channel_index]);
			}

			// If DMA handler is valid, start DMA
			if (timer_configs[timer_index].dma_ch_handle[timer_channel_index] == NULL) {
				PX4_INFO("failed to allocate dma for timer %u channel %u", timer_index, timer_channel_index);
				// continue;
				return;
			}

			// Set Capture mode for this channel
			io_timer_set_dshot_capture_mode(timer_index, timer_channel_index, _dshot_frequency);
			io_timer_capture_dma_req(timer_index, timer_channel_index, true);

			// Choose which CC register for this DMA stream
			uint32_t periph_addr = io_timers[timer_index].base + STM32_GTIM_CCR1_OFFSET + (4 * timer_channel_index);

			// Setup DMA for this channel
			px4_stm32_dmasetup(timer_configs[timer_index].dma_ch_handle[timer_channel_index],
					   periph_addr,
					   (uint32_t) dshot_capture_buffer[timer_channel_index],
					   CHANNEL_CAPTURE_BUFF_SIZE,
					   DSHOT_BIDIRECTIONAL_DMA_SCR);
		}
	}

	// Flush cache so DMA sees the data
	memset(dshot_capture_buffer, 0, sizeof(dshot_capture_buffer));
	up_clean_dcache((uintptr_t) dshot_capture_buffer,
			(uintptr_t) dshot_capture_buffer + DSHOT_CAPTURE_BUFFER_SIZE(MAX_NUM_CHANNELS_PER_TIMER));


	// Enable CaptureDMA and on all channels
	io_timer_set_enable(true, IOTimerChanMode_CaptureDMA, IO_TIMER_ALL_MODES_CHANNELS);

	// Start DMA on all the channels
	for (uint8_t output_channel = 0; output_channel < MAX_TIMER_IO_CHANNELS; output_channel++) {

		bool is_this_timer = timer_index == timer_io_channels[output_channel].timer_index;
		uint8_t timer_channel_index = timer_io_channels[output_channel].timer_channel - 1;
		bool channel_enabled = timer_configs[timer_index].enabled_channels[timer_channel_index];
		bool bidirectional_enabled = timer_configs[timer_index].bidirectional_channels[timer_channel_index];

		if (is_this_timer && channel_enabled && bidirectional_enabled) {
			// NOTE: we can't use DMA callback since GCR encoding creates a variable length pulse train
			stm32_dmastart(timer_configs[timer_index].dma_ch_handle[timer_channel_index], NULL, NULL, false);
		}
	}

	// 30us to switch regardless of DShot frequency + eRPM frame time + 10us for good measure
	hrt_abstime frame_us = (16 * 1000000) / _dshot_frequency; // 16 bits * us_per_s / bits_per_s
	hrt_abstime delay = 30 + frame_us + 10;
	hrt_call_after(&_cc_call, delay, capture_complete_callback, arg);

	// DEBUGGING
	// px4_arch_gpiowrite(GPIO_FMU_CH8, true);
}

static void capture_complete_callback(void *arg)
{
	uint8_t timer_index = *((uint8_t *)arg);

	// DEBUGGING
	// px4_arch_gpiowrite(GPIO_FMU_CH8, false);

	for (uint8_t output_channel = 0; output_channel < MAX_TIMER_IO_CHANNELS; output_channel++) {

		bool is_this_timer = timer_index == timer_io_channels[output_channel].timer_index;
		uint8_t timer_channel_index = timer_io_channels[output_channel].timer_channel - 1;
		bool channel_enabled = timer_configs[timer_index].enabled_channels[timer_channel_index];
		bool bidirectional_enabled = timer_configs[timer_index].bidirectional_channels[timer_channel_index];

		if (is_this_timer && channel_enabled && bidirectional_enabled) {
			// Disable capture DMA
			io_timer_capture_dma_req(timer_index, timer_channel_index, false);

			if (timer_configs[timer_index].dma_ch_handle[timer_channel_index] != NULL) {
				stm32_dmastop(timer_configs[timer_index].dma_ch_handle[timer_channel_index]);
				stm32_dmafree(timer_configs[timer_index].dma_ch_handle[timer_channel_index]);
				timer_configs[timer_index].dma_ch_handle[timer_channel_index] = NULL;
			}

			io_timer_unallocate_channel(output_channel);
		}
	}

	// Unallocate the timer as CaptureDMA
	io_timer_unallocate_timer(timer_index);

	// Invalidate the dcache to ensure most recent data is available
	up_invalidate_dcache((uintptr_t) dshot_capture_buffer,
			     (uintptr_t) dshot_capture_buffer + DSHOT_CAPTURE_BUFFER_SIZE(MAX_NUM_CHANNELS_PER_TIMER));

	// Process eRPM frames from all channels on this timer
	process_capture_results(timer_index);

	// Initialize back to DShotInverted to bring IO back to the expected idle state
	for (uint8_t output_channel = 0; output_channel < MAX_TIMER_IO_CHANNELS; output_channel++) {

		bool is_this_timer = timer_index == timer_io_channels[output_channel].timer_index;
		uint8_t timer_channel_index = timer_io_channels[output_channel].timer_channel - 1;
		bool channel_enabled = timer_configs[timer_index].enabled_channels[timer_channel_index];
		bool bidirectional_enabled = timer_configs[timer_index].bidirectional_channels[timer_channel_index];

		if (is_this_timer && channel_enabled && bidirectional_enabled) {
			io_timer_channel_init(output_channel, IOTimerChanMode_DshotInverted, NULL, NULL);
		}
	}

	// Enable all channels on this timer configured as DShotInverted
	io_timer_set_enable(true, IOTimerChanMode_DshotInverted, IO_TIMER_ALL_MODES_CHANNELS);
}

void process_capture_results(uint8_t timer_index)
{
	for (uint8_t channel_index = 0; channel_index < MAX_NUM_CHANNELS_PER_TIMER; channel_index++) {

		// Calculate the period for each channel
		const unsigned period = calculate_period(timer_index, channel_index);

		if (period == 0) {
			// If the parsing failed, set the eRPM to 0
			_erpms[channel_index] = 0;

		} else if (period == 65408) {
			// Special case for zero motion (e.g., stationary motor)
			_erpms[channel_index] = 0;

		} else {
			// Convert the period to eRPM
			_erpms[channel_index] = (1000000 * 60) / period;
		}
	}
}

/**
* bits  1-11    - throttle value (0-47 are reserved, 48-2047 give 2000 steps of throttle resolution)
* bit   12      - dshot telemetry enable/disable
* bits  13-16   - XOR checksum
**/
void dshot_motor_data_set(unsigned channel, uint16_t throttle, bool telemetry)
{
	uint8_t timer_index = timer_io_channels[channel].timer_index;
	uint8_t timer_channel_index = timer_io_channels[channel].timer_channel - 1;
	bool channel_enabled = timer_configs[timer_index].enabled_channels[timer_channel_index];

